# СПИСОК (list) - упорядоченная изменяемая коллекция объектов
# КОРТЕЖ (set) - упорядоченная неизменяемая коллекция объектов
# СЛОВАРЬ (dict) - неупорядоченное множество пар ключ/значение
# МНОЖЕСТВО (tuple) - неупорядоченный набор неповторяющихся объектов

# КОРТЕЖ
# - Почти как список, который нельзя изменить после создания
# (и добавить данные)
# - 
# - 
# - 

vowels = ('a', 'e', 'i', 'o', 'u')
vowels

# Кортеж всегда должен содержать хотя бы одну запятую
t = ('Python')
type(t) # str - строка

t2 = ('Python', )
type(t2) # tuple - кортеж
