"""
Напишите программу для печати всех уникальных значений в словаре.
Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "},
{" VIII ":" S007 "}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
"""

list_1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
list_2 = []
set_1 = set()

for i in list_1:
    for j in i.values():
        # set_1.add(j.replace(' ','')) # удаляем пробелы в значения
        set_1.add(j.strip()) # удаляет лишние пробелы слева и справа
        # print(j)
    # print(i.values())

print(set_1)
